def get_allowed_products(products: list[dict], max_price: int | float):
    allowed_products = []
    for product in products:
        if product['price'] <= max_price:
            allowed_products.append(product['product'])
    return allowed_products


print(get_allowed_products([{'product': 'bred', 'price': 25}], 24))
"""Написати функцію, яка отримує список діктів, причому дікти мають стандартну структуру
{'product': 'bred', 'price': 25} (зрозуміло, що назіи та ціни будуть різні), а також функція
отримує максимальну ціну продукту. повернути список назв продуктів, ціна яких не перевищує максимально
дозволену (навіщо це - уявіть, що ви пішли в магазин з лише 50 грн, і кажете комусь по телефону, які
продукти ви можете купити). написати 3 функції тестування - одна з них аналізує варіант, коли в списку
немає жодного підходящого продукту, друга - коли все підходить, третя - коли частина підходить, а частина
ні. ЗА БАЖАННЯМ: перевірити варіант, коли на вхід отримуємо пустий список (типу пустий магазин, нічого не
завезли) - має бути повернуто просто пустий список. для такого варіанту теж написати функцію тестування"""
